

//Примитивные типы данных:

// Number — числа(целые и с плавающей точкой): 5, 10.3, -7.
// String — строки(тексты): "Hello", 'World'.
// Boolean — булевы значения, которые могут быть либо true(истина), либо false(ложь).
// Null — специальное значение, которое обозначает отсутствие значения.
// Undefined — значение, которое присваивается переменной по умолчанию, если ей не присвоено другое значение.
// Symbol — уникальные и неизменяемые идентификаторы, которые обычно используются для уникальных ключей в объектах.
// BigInt — позволяет работать с очень большими числами, превышающими диапазон типов Number.
// Объекты — это сложные структуры данных, которые могут содержать различные данные, включая функции и другие объекты.Например, массивы и функции также являются объектами.



/* 
let name = String
let age = Number
let bool = Boolean

// 1 Создайте переменную, которая будет хранить ваш возраст через 5 лет.
let Myage = 18
let MyAge2 = 18 + 5
console.log(MyAge2);
////////////////////////



//2 Сравните свой текущий возраст с 18 с использованием оператора сравнения 
let MyAgeNow = 18
let MyAgeNowCompare = MyAgeNow === 18
console.log(MyAgeNowCompare);
////////////////////////


//3 Создайте объект person с тремя свойствами:
let person = {
    name: "Azamat",
    age: 18,
}
let isAdult = person.age === 18
console.log(isAdult);
////////////////////////

// 4 Дополнительное задание (по желанию):

let MyAge = 18 % 2
console.log(MyAge);
////////////////////////


 */

/* 
let age = Math.floor(Math.random() * 40);

if (age <= 18) {
    console.log("Вы несовершеннолетний!");
} else if (age <= 21) {
    console.log("Вы взрослый, но еще не можете пить алкоголь.");
} else {
    console.log("Вы полностью взрослый.");

}
console.log(age);

 */


let friends = ["Азамат", "Фаррух", "Мунира", "Лола", "Азим"];


/* for (let i of friends) {
    console.log(i);
} */



/* let i = 0;
while (i < friends.length) {
    if (friends[i][0] === "А") {
        console.log(friends[i]);
        break;
    }
    i++;
}
 */

/* 
for (let i = 0 + 1; i < 100 + 1; i++) {
    console.log(i);
} */


    for (let i = 0; i <= 50; i++) {
        if (i % 2 === 0) { // Проверяем, является ли число четным
            console.log(i); // Выводим четное число
        } else {
            console.log("Не четное"); // Выводим "Не четное" для нечетных чисел
        }
    }
    