
//////////////////////////////////////////////////////////////////////////////////
// 1. Создаем массив с числами
const numbers = [10, 20, 30];

// 2. Добавляем элементы в конец массива
numbers.push(40, 50);

// 3. Удаляем последний элемент из массива
const last = numbers.pop();

// 4. Выводим массив и удалённый элемент
console.log("Массив:", numbers);
console.log("Удалённый элемент:", last);


//////////////////////////////////////////////////////////////////////////////////
const arr = [1, 2, 3, 4, 5];
const part = arr.slice(2);
console.log(part); // [3, 4, 5]
// Берёт все элементы, начиная с индекса 2 до конца массива.
//////////////////////////////////////////////////////////////////////////////////

const str = "a,b,c,d,e";
const result = str.split(",", 3); // Разделить максимум на 3 части
console.log(result); // ["a", "b", "c"]
///////////////////////////////////////////////////////////////////////////////////


//Метод some() проверяет, удовлетворяет ли хотя бы один элемент массива условию, заданному в функции. Возвращает true или false.
const nums = [1, 2, 3, 4, 5];
const hasLargeNumber = nums.some(num => num > 3);
console.log(hasLargeNumber);// true
///////////////////////////////////////////////////////////////////////////////////



