// JavaScript — это язык программирования, который используется для создания интерактивных и динамичных веб-страниц.

// Map  
// map — это метод массива, который создаёт новый массив, применяя функцию к каждому элементу исходного массива.  

// forEach  
// forEach — используется для перебора массива, выполняет указанную функцию для каждого элемента, но не возвращает новый массив.  

// reduce  
// reduce — используется для накопления значений, позволяет свести массив к единому значению.  

// find  
// find — используется для нахождения первого элемента, который соответствует условию, и возвращает его. Если ничего не найдено, он возвращает undefined.  

// findIndex  
// findIndex — похож на find, но вместо элемента он возвращает индекс первого подходящего элемента. Если ничего не найдено, возвращает -1.  

//filter
//filter — это метод массива, который   новый массив, включающий только те элементы, которые соответсвует условию.
